# У банкоматі є по 10 купюр номіналів: 10,20,50,100,200,500,1000.
# Бакуомат видає дрібними купюрами, але не більше 10 штук кожної купюри

bills = 10,20,50,100,200,500,1000, 1    #кортеж з бар'єром
s = int(input("Введіть суму від 10 до 18800, кратну 10: ")) 

if s%10 == 0 and 9 < s < 18801:
   i = 0
   while s > 0:     
       n = 10
       while (r:=s-n*(t:=bills[i]))<0 or r%bills[i+1]:
           n -= 1
       print(f"{t:22} x {n:2}")   
       s -= t * n       
       i += 1
   if s: print(t, s//t)  
else: print('Суму видати неможливо!')    



"""
 Розв'язок існує, якщо сума кратна 10 і належить [10; 18800].

 Логічна умова зовнішнього циклу:
 w h i l e  поточна сума додатна
  
 Складена логічна умова внутрішнього циклу:
 w h i l e  а) поточна різниця (cума-добуток n*bills[i]) < 0
                           or
            б) ця різниця не кратна наступному номіналу"
"""











"""
bill = 10,20,50,100,200,500,1000 #кортеж
s = int(input("Сума (від 10 до 3800): "))         #max = 18_800
for i, k in enumerate(bill):
    #print(i, k)
    n = 10
    while (r:=(s-n*k)) or r%bill[i+1]:
        n -= 1
        #print(k, bill[i+1])
    print(k, n)
    s -= k*n
    if s <= 0: break    
"""
















"""
bill = (x for x in[10,20,50,100,200,500,1000]) #ітератор
s = int(input("Сума (від 10 до 3800): "))         #max = 18_800

for k in bill:
    n = 10
    while (r:=(s-n*next(bill))) or r%next(bill): n -= 1
    #print(k, next(bill))
    print(k, n)
    s -= k*n
    if s < 0: break    
"""
